<center><h1><b><font size="6">Pandas Series: .sort_index()</font></b></h1></center>

#### Import Pandas

In [1]:
import pandas as pd

#### Load the data

In [2]:
data = pd.read_csv('./data/Location.csv')
location_data = data.copy()
location_data.head()

      Location
0   Location 3
1   Location 6
2   Location 8
3  Location 26
4  Location 34

In [4]:
location_data.sort_values(by='Location', ascending=False)

        Location
372  Location 99
757  Location 98
128  Location 97
482  Location 97
271  Location 97
..           ...
202  Location 10
298  Location 10
637   Location 1
884   Location 1
465   Location 1

[1043 rows x 1 columns]

#### save it into a new variable

In [7]:
location_data_sv = location_data.sort_values(by='Location', ascending=False)
location_data_sv.head()

        Location
372  Location 99
757  Location 98
128  Location 97
482  Location 97
271  Location 97

In [8]:
location_data_sv.index

Index([ 372,  757,  128,  482,  271,  669,  612,   29,  518,  598,
       ...
        904,  912, 1010,   14,  716,  202,  298,  637,  884,  465],
      dtype='int64', length=1043)

In [9]:
location_data_sv.index.sort_values()

Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
       ...
       1033, 1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042],
      dtype='int64', length=1043)

In [10]:
location_data_sv.head()

        Location
372  Location 99
757  Location 98
128  Location 97
482  Location 97
271  Location 97

In [11]:
location_data_sv.index = location_data_sv.index.sort_values()

In [12]:
location_data_sv

         Location
0     Location 99
1     Location 98
2     Location 97
3     Location 97
4     Location 97
...           ...
1038  Location 10
1039  Location 10
1040   Location 1
1041   Location 1
1042   Location 1

[1043 rows x 1 columns]

In [13]:
location_data_sv = location_data.sort_values(by='Location', ascending=False)
location_data_sv.head()

        Location
372  Location 99
757  Location 98
128  Location 97
482  Location 97
271  Location 97

#### sort_index

In [18]:
location_data_sv.sort_index()

         Location
0      Location 3
1      Location 6
2      Location 8
3     Location 26
4     Location 34
...           ...
1038  Location 73
1039  Location 82
1040  Location 11
1041  Location 26
1042  Location 94

[1043 rows x 1 columns]

In [19]:
location_data_sv = location_data_sv.sort_values(by='Location', ascending=True)

In [20]:
location_data_sv

        Location
465   Location 1
884   Location 1
637   Location 1
14   Location 10
912  Location 10
..           ...
482  Location 97
669  Location 97
128  Location 97
757  Location 98
372  Location 99

[1043 rows x 1 columns]